# -*- coding: utf-8 -*-
"""dz5

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1264Q-IfY3kg6keGAT6S8KJxh95lUOjuj
"""

'''1. Создать программный файл в текстовом формате, записать в него построчно данные,
вводимые пользователем. Об окончании ввода данных будет свидетельствовать пустая строка.'''

f_obj = open("new_f1.txt", 'w')
a = ' '
while a != '':
  a = input('Введите строку для созранения в файл, или пустую строку для завершения записи: ')
  f_obj.write(a)
  if a != '':
    f_obj.write('\n')
f_obj.close()

print('')

with open("new_f1.txt") as f_obj:
  for i in f_obj:
    print(i)

'''2. Создать текстовый файл (не программно), сохранить в нём несколько строк, выполнить подсчёт строк и слов в каждой строке.'''

#файл создаю программно потому что делаю в колабе, он потом файлы удаляет

f_obj = open("new_f2.txt", 'w')
f_obj.writelines('one stroka: slowo slowlo slowo lowo \n')
f_obj.writelines('two stroka: slowo slowlo slowo lowo owo wo \n')
f_obj.writelines('thry stroka: slowo slowlo \n')
f_obj.close()

c_s = 0
c_w = 0

with open("new_f2.txt") as f_obj:
    for i in f_obj:
      c_s += 1
      c_w += len(i.split())

print(f'В файле {c_s} строк и {c_w} слов')

'''3. Создать текстовый файл (не программно). Построчно записать фамилии сотрудников и величину их окладов
(не менее 10 строк). Определить, кто из сотрудников имеет оклад менее 20 тысяч, вывести фамилии этих сотрудников.
Выполнить подсчёт средней величины дохода сотрудников.
Пример файла:

Иванов 23543.12
Петров 13749.32'''

sp = ['Иванов 23543.12\n',
      'Петров 13749.32\n',
      'Сидоров 33123.32\n',
      'Васюков 15132.33\n',
      'Зеленый 13832.33\n',
      'Смирнов 23112.33\n',
      'Петровский 16132.33\n',
      'Обкатышь 19132.33\n',
      'Уммамбек 23132.33\n',
      'Царицкий 33132.33\n']

f_obj = open("new_f3.txt", 'w')
f_obj.writelines(sp)
f_obj.close()

szp = []
sps = []

with open("new_f3.txt") as f_obj:
    for i in f_obj:
      a = float(i.split()[1])
      szp.append(a)
      if a > 20000:
        sps.append(i.split()[0])

print(f"Сотрудники имеющие оклад свыше 20 тыс.: {', '.join(sps)}")
print(f'Средняя оклад сотрудников: {round(sum(szp)/len(szp),2)}')

#4. Создать (не программно) текстовый файл со следующим содержимым:

sp1 = ['One — 1\n',
       'Two — 2\n',
       'Three — 3\n',
       'Four — 4\n']

# Напишите программу, открывающую файл на чтение и считывающую построчно данные.
# При этом английские числительные должны заменяться на русские.
# Новый блок строк должен записываться в новый текстовый файл.

f_obj = open("new_f4.txt", 'w')
f_obj.writelines(sp1)
f_obj.close()

sp_r = {'One': 'Один',
       'Two': 'Два',
       'Three': 'Три',
       'Four': 'Четыре'}

sp_2 = []

with open("new_f4.txt", 'r') as f_obj:
  for i in f_obj:
    a = i.split()
    if a[0] in sp_r:
      sp_2.append(sp_r[a[0]] + ' ' + ' '.join(a[1:]) + '\n')

f_obj = open("new_f4_1.txt", 'w')
f_obj.writelines(sp_2)
f_obj.close()

with open("new_f4_1.txt", 'r') as f_obj:
  for i in f_obj:
    print(i)

'''5. Создать (программно) текстовый файл, записать в него программно набор чисел, разделённых пробелами.
Программа должна подсчитывать сумму чисел в файле и выводить её на экран.'''

import random

a = [str(random.randint(1,10)) for i in range(10)]

f_obj = open("new_f5.txt", 'w')
f_obj.writelines(' '.join(a))
f_obj.close()

with open("new_f5.txt", 'r') as f_obj:
  for i in f_obj:
    print(sum([int(i) for i in i.split()]))

'''6.Сформировать (не программно) текстовый файл.
В нём каждая строка должна описывать учебный предмет и наличие лекционных, практических и лабораторных занятий по предмету.
Сюда должно входить и количество занятий. Необязательно, чтобы для каждого предмета были все типы занятий.
Сформировать словарь, содержащий название предмета и общее количество занятий по нему. Вывести его на экран.'''

#Примеры строк файла:

sp = {'Информатика': {'л': 100, 'пр': 50, 'лаб': 20},
      'Физика': {'л':30, 'лаб': 10},
      'Физкультура': {'пр': 30},}

#Пример словаря: {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}

import json

with open("new_f6.json", 'w') as f_obj:
  json.dump(sp, f_obj)

sl = {}
su = []

with open("new_f6.json") as read_f:
  data = json.load(read_f)
  for i,j in data.items():
    s = 0
    for i1, j1 in j.items():
      s += j1
    sl[i] = s

sl

'''7. Создать вручную и заполнить несколькими строками текстовый файл,в котором каждая строка будет содержать данные о фирме:
название, форма собственности, выручка, издержки.
Пример строки файла: firm_1 ООО 10000 5000.'''

sp = ['firm_1 ООО 10000 5000\n',
      'firm_2 AO 30000 28000\n',
      'firm_3 IP 1000 4000\n',
      'firm_4 ООО 20000 10000\n',
      'firm_5 ООО 20000 25000\n']

f_obj = open("new_f7.txt", 'w')
f_obj.writelines(sp)
f_obj.close()

'''Необходимо построчно прочитать файл, вычислить прибыль каждой компании, а также среднюю прибыль.
Если фирма получила убытки, в расчёт средней прибыли её не включать.
Далее реализовать список. Он должен содержать словарь с фирмами и их прибылями, а также словарь со средней прибылью.
Если фирма получила убытки, также добавить её в словарь (со значением убытков).

Пример списка: [{“firm_1”: 5000, “firm_2”: 3000, “firm_3”: 1000}, {“average_profit”: 2000}].'''

sr = []
spi = [{}]

with open("new_f7.txt", 'r') as f_obj:
  for i in f_obj:
    a = [w for w in i.split()]
    spi[0][a[0]] = int(a[2]) - int(a[3])
    sr.append(int(a[2]) - int(a[3]))

'''Итоговый список сохранить в виде json-объекта в соответствующий файл.
Пример json-объекта:
[{"firm_1": 5000, "firm_2": 3000, "firm_3": 1000}, {"average_profit": 2000}]
Подсказка: использовать менеджер контекста.'''

spi.append({'average_profit':sum(sr)/len(sr)})

with open("new_f7_1.json", "w") as w_f:
  json.dump(spi, w_f)

print(spi)

