# -*- coding: utf-8 -*-
"""lessen 7

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1u4BknT5BkdnGSyv21ioRhnhxIpdsavSc
"""

'''1. Реализовать класс Matrix (матрица). Обеспечить перегрузку конструктора класса (метод __init__()),
который должен принимать данные (список списков) для формирования матрицы.
Подсказка: матрица — система некоторых математических величин, расположенных в виде прямоугольной схемы.
Примеры матриц: 3 на 2, 3 на 3, 2 на 4.

31    32         3    5    32        3    5    8    3
37    43         2    4    6         8    3    7    1
51    86        -1   64   -8
Следующий шаг — реализовать перегрузку метода __str__() для вывода матрицы в привычном виде.
Далее реализовать перегрузку метода __add__() для реализации операции сложения двух объектов класса Matrix (двух матриц).
Результатом сложения должна быть новая матрица.
Подсказка: сложение элементов матриц выполнять поэлементно
— первый элемент первой строки первой матрицы складываем с первым элементом первой строки второй матрицы и т.д.'''

class Matrix:

  def __init__(self, my_list):
    self.my_list = my_list

  def __str__(self):
    for row in self.my_list:
      for _ in row:
        print(f"{_:5}", end="")
      print()
    return ''

  def __add__(self, nex):
    for i_1 in range(len(self.my_list)):
      for i_2 in range(len(nex.my_list[i_1])):
        self.my_list[i_1][i_2] = self.my_list[i_1][i_2] + nex.my_list[i_1][i_2]
    return Matrix.__str__(self)


m1 = Matrix([[-1, 5, 1], [5, 0, 1], [0, -5, -1]])
Matrix.__str__(m1)
print()

m2 = Matrix([[3, -2, 2], [2, 2, 2], [2, 2, -2]])
Matrix.__str__(m2)
print()

print('результат сложения:\n')
print(m1.__add__(m2))

'''2. Реализовать проект расчёта суммарного расхода ткани на производство одежды. Основная сущность (класс) этого проекта
— одежда, которая может иметь определённое название. К типам одежды в этом проекте относятся пальто и костюм.
У этих типов одежды существуют параметры: размер (для пальто) и рост (для костюма). Это могут быть обычные числа: V и H, соответственно.
Для определения расхода ткани по каждому типу одежды использовать формулы: для пальто (V/6.5 + 0.5), для костюма (2*H + 0.3).
Проверить работу этих методов на реальных данных.
Реализовать общий подсчет расхода ткани. Проверить на практике полученные на этом уроке знания: реализовать абстрактные классы
для основных классов проекта, проверить на практике работу декоратора @property.'''

from abc import ABC, abstractmethod

class Clothes(ABC):
  def __init__(self, parameter):
    self.parameter = parameter
  @abstractmethod
  def calculate(self):
    pass

class Coat(Clothes):
  @property
  def calculate(self):
    return round((self.parameter / 6.5) + 0.5)

class Costume(Clothes):
  @property
  def calculate(self):
    return round((2 * self.parameter) + 0.3)

coat = Coat(100)
costume = Costume(100)

print(f'Ткани на пально: {coat.calculate}')
print(f'Ткани на косюм: {costume.calculate}')
print(f'Всего нужно ткани: {coat.calculate+costume.calculate}')

'''3. Реализовать программу работы с органическими клетками, состоящими из ячеек.
Необходимо создать класс Клетка. В его конструкторе инициализировать параметр, соответствующий количеству ячеек клетки (целое число).
В классе должны быть реализованы методы перегрузки арифметических операторов:
сложение (__add__()), вычитание (__sub__()), умножение (__mul__()), деление (__truediv__()).

Данные методы должны применяться только к клеткам и выполнять увеличение, уменьшение, умножение и целочисленное (с округлением до целого)
деление клеток, соответственно.

Сложение. Объединение двух клеток. При этом число ячеек общей клетки должно равняться сумме ячеек исходных двух клеток.

Вычитание. Участвуют две клетки. Операцию необходимо выполнять только если разность количества ячеек двух клеток больше нуля,
иначе выводить соответствующее сообщение.

Умножение. Создаётся общая клетка из двух. Число ячеек общей клетки определяется как произведение количества ячеек этих двух клеток.

Деление. Создаётся общая клетка из двух. Число ячеек общей клетки определяется как целочисленное деление количества ячеек этих двух клеток.

В классе необходимо реализовать метод make_order(), принимающий экземпляр класса и количество ячеек в ряду.
Данный метод позволяет организовать ячейки по рядам.
Метод должен возвращать строку вида *****\n*****\n*****..., где количество ячеек между \n равно переданному аргументу.
Если ячеек на формирование ряда не хватает, то в последний ряд записываются все оставшиеся.
Например, количество ячеек клетки равняется 12, количество ячеек в ряду — 5. Тогда метод make_order() вернёт строку: *****\n*****\n**.
Или, количество ячеек клетки равняется 15, количество ячеек в ряду — 5. Тогда метод make_order() вернёт строку: *****\n*****\n*****.
Подсказка: подробный список операторов для перегрузки доступен по ссылке.'''

class Cell:
  def __init__(self,n):
    self.n = n
  def __add__(self, other):
    return '*' * (self.n + other.n)
  def __sub__(self, other):
    if self.n != other.n:
      return '*' * abs(self.n - other.n)
    else:
      return 'Все вычлось'
          
  def __mul__(self, other):
    return '*' * (self.n * other.n)
  def __truediv__(self, other):
    try:
      rez = self.n / other.n
      if int(rez) > 0:
        return '*' * int(rez)
      else:
        return 'Резудьтат деления равен 0'
    except ZeroDivisionError as err:
      return f'деление на 0 {err}'

  def make_order(self,n_el):
    rez =''
    rez_div, ost = divmod(self.n,n_el)
    for i in range(rez_div):
      rez += f'{n_el * "*"}\n'
    rez += f'{ost * "*"}'
    return rez


el = Cell(2)
el_2 = Cell(4)
el_3 = Cell(15)
print(el+el_2, '\n')
print(el-el_2, '\n')
print(el*el_2, '\n')
print(el_3/el_2, '\n')
print(el_3.make_order(4))